org/roam/software_packaging.org
:PROPERTIES:
:ID:       ab1cf09d-eedf-4134-aa33-2b7cfd1eca78
:END:
#+title: software-packaging
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* Packaging
Lets make the same thing but differently!
- [[id:4e76d981-fd7c-43b0-9d8c-120386135729][guix]]
- [[id:b6edbb6f-d886-4362-8654-5e4986c81a21][ansible]]
- flatpak
  - bubblewrap for isolation
  - flathub for distribution
  - non root user tool
  - pamac flatpak plugin for manjaro
  - bloats with old versions without updates
    - multiple nvidia driver versions etc
  - ~flatpak remote-add --user --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo~
  - ~gio mime x-scheme-handler/http firefox.desktop~ and ~gio mime x-scheme-handler/https firefox.desktop~
  - mount ~$HOME/.var~ for flatpak on other drive with ~sudo mount --bind /gnu/xdg/.var $HOME/.var~
  - ~sudo flatpak override <application-id> --filesystem=<path>~ to share a path
  - ~flatpak install --user bundle.flatpak~ to install from bundle file

- rpms
  - redhat based distros
  - can use alien to convert deb and rpm
- debs
  - debian based distros
- pkg
  - arch based distros
  - ~paccache -ruk0~ to delete cache
  - makepkg to build
- appimages
  - on wayland use ~QT_QPA_PLATOFROM=xcb ./LibreOffice-fresh.basic-x86_64.AppImage~ if wayland error ~QWindow::requestActivate~
  - uses old glibc
  - uses fuse
    - fuse breakages can break compat (ex. ubuntu 21.04)
